{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c7c3acb5",
   "metadata": {},
   "source": [
    "# Курсовая работа\n",
    "## Выполнил студент группы БСТ2002 Пресняков Данил Русланович"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f32326fd",
   "metadata": {},
   "source": [
    "# Задание №1 1141A\n",
    "## «Игра 23» — вот во что сейчас играет Поликарп. Изначально у него есть целое число n и его цель преобразовать его в целое число m. За один ход он может умножить n на 2 или умножить n на 3. Он может совершать любое количество ходов. Выведите количество ходов, сколько необходимо Поликарпу, чтобы получить из числа n число m. Выведите -1, если это невозможно сделать. Легко доказать, что любой способ преобразования из числа n в число m содержит одинаковое количество ходов (т.е. количество ходов не зависит от способа преобразования)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f7eb7e77",
   "metadata": {},
   "outputs": [],
   "source": [
    "ans = 0\n",
    "n, m = map(int, input().split())\n",
    "while n < m:\n",
    "    if m % (n * 2) == 0:\n",
    "        n = 2 * n\n",
    "    else:\n",
    "        n = 3 * n\n",
    "    ans += 1\n",
    "\n",
    "if m == n:\n",
    "    print(ans)\n",
    "else:\n",
    "    print(-1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e89d9c2e",
   "metadata": {},
   "source": [
    "# Задание №2 1263А\n",
    "## У вас есть три кучи сладостей, состоящие из красных, зеленых и синих конфет: первая куча состоит только из r красных конфет, вторая куча состоит только из g зеленых конфет, третья куча состоит только из b синих конфет. Каждый день Таня съедает ровно две конфеты различных цветов. Она выбирает любые цвета конфет, единственное ограничение - она не может съесть две конфеты одного цвета за один день. Найдите максимальное количество дней, в течение которых Таня может есть сладости. Каждый день Таня должна съедать ровно две конфеты."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0eb7484e",
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in range(int(input())):\n",
    "    r,g,b = sorted(map(int,input().split()))\n",
    "    if b <= r+g:\n",
    "        print((r+g+b)//2)\n",
    "    else:\n",
    "        print(r+g)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "897c3569",
   "metadata": {},
   "source": [
    "# Задание №3 630D\n",
    "## #После успешно прохождения испытательного срока в компании ИТ-града, которая занимается играми, Петя вошёл в группу программистов, которая занимается созданием новой пошаговой стратегии в стиле известной «Heroes of Might & Magic». Одним из элементов игры являются пошаговые бои больших отрядов противников на бесконечных полях, где каждая ячейка представляет собой шестиугольник. Некоторые из магических эффектов персонажей способны воздействовать сразу на несколько ячеек поля, которые находятся от ячейки применения эффекта на расстоянии не более n. Расстоянием между ячейками назовём минимальное количество переходов через границу ячейки, позволяющее попасть из одной выбранной ячейки в другую.Легко заметить, что количество ячеек, которое подпадает под магический эффект, достаточно быстро растёт при увеличении числа n, что может отрицательно сказываться на производительности игры. Поэтому Петя решил написать программу, которая бы по числу n определяла количество ячеек, которые придётся перерисовать при применении эффекта, чтобы гейм-дизайнеры могли поддерживать баланс между масштабностью эффектов и производительностью игры. Помогите ему в этом. Найдите количество шестиугольников, расстояние от которых до заданной клетки не превышает n.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "49c5bf49",
   "metadata": {},
   "outputs": [],
   "source": [
    "a=int(input())\n",
    "print((a*a+a)*3+1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d4ec3b56",
   "metadata": {},
   "source": [
    "# Задание №4 102B\n",
    "## #Посмотрев последний фильм про Гарри Поттера, маленький Геральд решил тоже попрактиковаться в магии. Он нашел в папиной магической книге заклинание, которое превращает любое число в его сумму цифр. И тут Геральду как раз попалось число n. Сколько раз Геральд сможет применить к нему заклинание до того, как число станет однозначным?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57f22920",
   "metadata": {},
   "outputs": [],
   "source": [
    "n=input()\n",
    "c=0\n",
    "while len(n)>1:\n",
    "    n=str(sum(map(int,n)))\n",
    "    c+=1\n",
    "print(c)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e4048c6a",
   "metadata": {},
   "source": [
    "# Задание №5 1418А\n",
    "## Вы играете в очень популярную игру, которая называется Cubecraft. Изначально у вас в инвентаре находится одна палка и вы хотите скрафтить k факелов. Один факел можно скрафтить при помощи одной палки и одного угля. К счастью, вы встретили очень щедрого странствующего торговца, у которого есть два предложения для обмена: обменять 1 палку на x палок (вы теряете 1 палку и получаете x палок). обменять y палок на 1 уголь (вы теряете y палок и получаете 1 уголь). В течение одного обмена вы можете использовать только одно из этих двух предложений. Вы можете использовать любые предложения для обмена сколько угодно раз, в любом порядке. Ваша задача — найти минимальное количество обменов, которое вам необходимо совершить, чтобы вы смогли скрафтить хотя бы k факелов. Ответ всегда существует при заданных ограничениях. Вам необходимо ответить на t независимых наборов тестовых данных."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "64d5b862",
   "metadata": {},
   "outputs": [],
   "source": [
    "t=int(input())\n",
    "for i in range(t):\n",
    "    x,y,k=map(int,input().split())\n",
    "    print(k-(1-y*k-k)//(x-1))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
